package ru.javach.java.thread.hat;

int number;
int previous;

[b]ТРЕД ПО ЖАБЕ #number[/b]

[b]Что такое Java?[/b]
Java - язык программирования с классами [spoiler](aka объектно ориентированный)[/spoiler], где нужно явно указывать тип объявляемых переменных [spoiler](aka со строгой типизацией)[/spoiler].
[b]Заебись! А что ещё делает Java лучшим языком программирования?[/b]
- На Java написано столько всего, что [b]любая[/b] твоя невообразимая идея уже существует в виде библиотеки, которую можно скочать и юзать
- [b]Java - мультипарадигменный язык[/b], тут можно писать в любом стиле, который тебе вздумается, даже к памяти можно получить доступ через Unsafe, но, при этом спроектирован язык для того, чтобы на нём писали в ОО-стиле.
- От прошлого пункта плавно перешли к отличной проработке языка - [b]язык с самого начала задумывался как язык для ООП и многопоточности[/b], благодаря чему писать чистокод на Java легче лёгкого!
- [b]Java - относительно молодой язык[/b], который до сих пор активно развивается жидами из Oracle, при этом почти неполживо опенсорсно. 
- Однако, Java имеет чувство собственного достоинства - Java оставляет тестирование всех новых, молодёжных и короткоживущих идей дохуя инициативным бегункам из других языков, принимая в свой состав только доказавшие свою годность временем идеи, [b]никогда не ломая обратную совместимость[/b].

[u]Тред по жабе на гитхабе:[/u] [spoiler]https://github.com/java2ch/java-thread[/spoiler]
[u]Вики по вкатыванию в джаву:[/u]  [spoiler]https://github.com/java2ch/java-thread/wiki[/spoiler]

[b]Предыдущий:[/b] >>previous