package ru.javach.java.thread.hat;

int number;
int previous;

[b]Java Thread №number[/b]

[b]Что такое Java?[/b]
Java - язык программирования с классами [spoiler](aka объектно ориентированный)[/spoiler], где нужно явно указывать тип объявляемых переменных [spoiler](aka со строгой типизацией)[/spoiler].
[b]Заебись. А что ещё делает Java лучшим языком программирования?[/b]
- На Java написано столько всего, что [b]любая[/b] твоя невообразимая идея уже существует в виде библиотеки, которую можно скочать и юзать
- [b]Java - мультипарадигменный язык[/b], тут можно писать в любом стиле, который тебе вздумается, даже к памяти можно получить доступ через Unsafe, но, при этом спроектирован язык для того, чтобы на нём писали в объектно-ориентированном стиле
- От прошлого пункта плавно перешли к отличной проработке языка - [b]язык с самого начала задумывался как язык для ООП и многопоточности[/b], благодаря чему писать чистокод на Java легче лёгкого!
- [b]Java - относительно молодой язык[/b], который до сих пор активно развивается жидами из Oracle, при этом почти неполживо опенсорсно. 
- Java следует принципу [b]write once[/b] во всём. [b]Java никогда не ломает обратную совместимость[/b] - твой код, написанный на Java 1.2 будет работать на Java 19 - и не зависит от платформы, являя из себя единственный полностью кроссплатформенный язык с кроссплатформенной экосистемой (если не считать языков-паразитов на JVM).

[u]Тред по жабе на гитхабе:[/u] https://github.com/java2ch/java-thread
[u]Вики по вкатыванию в джаву:[/u] https://github.com/java2ch/java-thread/wiki

[b]Предыдущий:[/b] >>previous
